seblee/TQ01M1-GL5/bsp/stm32f10x/drivers/usart_bsp.c
void rt_hw_usart_init(void)
{
    struct stm32_uart *uart;
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;

    RCC_Configuration();
    GPIO_Configuration();

#if defined(RT_USING_UART1)
    uart = &uart1;
    config.baud_rate = BAUD_RATE_115200;

    serial1.ops = &stm32_uart_ops;
    serial1.config = config;

    NVIC_Configuration(uart);

    /* register UART1 device */
    rt_hw_serial_register(&serial1, "uart1",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX |
                              RT_DEVICE_FLAG_INT_TX | RT_DEVICE_FLAG_DMA_RX,
                          uart);
#endif /* RT_USING_UART1 */

#if defined(RT_USING_UART2)
    uart = &uart2;

    config.baud_rate = BAUD_RATE_115200;
    serial2.ops = &stm32_uart_ops;
    serial2.config = config;

    NVIC_Configuration(uart);

    /* register UART2 device */
    rt_hw_serial_register(&serial2, "uart2",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX |
                              RT_DEVICE_FLAG_INT_TX | RT_DEVICE_FLAG_DMA_RX,
                          uart);
#endif /* RT_USING_UART2 */

#if defined(RT_USING_UART3)
    uart = &uart3;

    config.baud_rate = BAUD_RATE_115200;

    serial3.ops = &stm32_uart_ops;
    serial3.config = config;

    NVIC_Configuration(uart);

    /* register UART3 device */
    rt_hw_serial_register(&serial3, "uart3",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX |
                              RT_DEVICE_FLAG_INT_TX | RT_DEVICE_FLAG_DMA_RX,
                          uart);
#endif /* RT_USING_UART3 */

#if defined(RT_USING_UART4)
    uart = &uart4;

    config.baud_rate = BAUD_RATE_9600;

    serial4.ops = &stm32_uart_ops;
    serial4.config = config;

    NVIC_Configuration(uart);

    /* register UART4 device */
    rt_hw_serial_register(&serial4, "uart4",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX |
                              RT_DEVICE_FLAG_INT_TX | RT_DEVICE_FLAG_DMA_RX,
                          uart);
#endif /* RT_USING_UART4 */

#if defined(RT_USING_UART5)
    uart = &uart5;
    config.baud_rate = BAUD_RATE_115200;

    serial5.ops = &stm32_uart_ops;
    serial5.config = config;

    NVIC_Configuration(&uart5);

    /* register UART5 device */
    rt_hw_serial_register(&serial5, "uart5",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX,
                          uart);
#endif /* RT_USING_UART5 */
}

/**********************************佛山吉宝加热器***********************************************/

void Usart1_Rcc_Conf(void)
{
    /* Enable UART GPIO clocks */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    /* Enable UART clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
    return;
}

void Usart1_Gpio_Conf(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    //USART1 Tx(PA.09)
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    //USART1 Rx(PA.10)
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    return;
}
void Usart1_Init_Conf(void)
{
    //USART1配置
    USART_InitTypeDef USART_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    USART_InitStructure.USART_BaudRate = 9600;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;

    ENTER_CRITICAL_SECTION(); //关全局中断

    USART_Init(USART1, &USART_InitStructure);
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    USART_Cmd(USART1, ENABLE);

    //=====================中断初始化======================================
    //设置NVIC优先级分组为Group2：0-3抢占式优先级，0-3的响应式优先级
    //	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    EXIT_CRITICAL_SECTION(); //开全局中断
    return;
}

void Usart1_Var_Init(uint8_t port)
{
    g_ComStat[port] = INIT_Apply;
    g_ComGap[port] = 0;
    Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
    memset(&g_ComBuff[port][0], 0x00, PROTOCOL_FRAME_MaxLen);
    return;
}
void Heat_Usart_Init(uint8_t port)
{
    Usart1_Var_Init(port);
    Usart1_Rcc_Conf();
    Usart1_Gpio_Conf();
    Usart1_Init_Conf();
    return;
}
//通信串口初始化
void xPort_Usart_Init(uint8_t ucMB_Number)
{
    switch (ucMB_Number)
    {
    case UART_HEAT:
        Heat_Usart_Init(ucMB_Number);
        break;
    case UART_PM25:

        break;
    default:
        break;
    }
    return;
}

void Heat_Usart_Close(void)
{
    USART_ClearITPendingBit(USART1, USART_IT_RXNE);
    USART_Cmd(USART1, DISABLE);
    return;
}
//关闭串口
void xPort_Usart_Close(uint8_t ucMB_Number)
{
    switch (ucMB_Number)
    {
    case UART_HEAT:
        Heat_Usart_Close();
        break;
    case UART_PM25:

        break;
    default:
        break;
    }
    return;
}

//串口发送数据
uint8_t UART_Send(uint8_t *u8Buf, uint8_t u8Len)
{
    uint8_t u8Se;
    uint8_t i;
    if (u8Len == 0)
    {
        return u8Se;
    }
    for (i = 0; i < u8Len; i++)
    {
        USART_SendData(USART1, u8Buf[i]); //发送数据
        while (USART_GetFlagStatus(USART1, USART_FLAG_TC) != SET)
            ; //等待发送结束
        u8Se = 1;
    }
    return u8Se;
}

//串口发送数据
uint8_t Heat_Send(uint8_t u8Type, uint8_t u8OC,  uint16_t u16WL)
{
    extern sys_reg_st g_sys;
    uint8_t u8SendBuf[HEATWRITE_NUM + 2] = {0};
    uint8_t u8Head = 0xAA;
    uint8_t u8Addr = 0x01;
    uint16_t u16Sum = 0x00;
		uint8_t u8Temp=0;
    uint8_t i;
    if (g_sys.config.ComPara.u16Heater_PM25==PM25_ZP01)
		{
        return 1;			
		}
		else
    if (g_sys.config.ComPara.u16Heater_PM25==Heater_JB)
		{
			 if (u8Type == HEAT_READPARA)
				{
						u8SendBuf[0] = 0xA5;
//						rt_kprintf("u8SendBuf[0]=%x\n", u8SendBuf[0]);
						return UART_Send(&u8SendBuf[0], 1);
				}
				else
				{
					//热水温度
//						switch(g_sys.config.ComPara.u16HotWater_Temp)
//						{
//							case 0x00:
//									u8Temp =25;//常温
//									break;
//							case 0x01:
//									u8Temp =45;//45℃	
//									break;	
//							case 0x02:
//									u8Temp =65;//65℃		
//									break;
//							case 0x03:
//									u8Temp =80;//80℃		
//									break;	
////							case 0x03:
////									u8Temp =85;//85℃		
////									break;	
//							case 0x04:
//									u8Temp =100;//100℃		
//									break;	
//							default:
//									u8Temp =65;//65℃		
//									break;																	
//						}
						u8Temp =(int8_t)g_sys.config.ComPara.u16HotWater_Temp;
						u8Temp = u8Temp+(int8_t)g_sys.config.ComPara.u16HotWater_Cali;

