seblee/TQ01M1-GL5/bsp/stm32f10x/drivers/usart_bsp.c
//佳芯加热器串口接收数据
uint8_t JX_HeatPortSerialReceiveFSM(uint8_t port)
{
    extern sys_reg_st g_sys;
    uint8_t RXDByte;
    uint16_t u16CheckSum;
    uint8_t u8Length=7;

    g_sys.status.ComSta.TEST |= 0x01;
    /* Always read the character. */
    (void)xPortSerialGetByte((char *)&RXDByte, port);
    g_ComGap[port] = 0;
    switch (Protocol[port].StatckStatus)
    {
    case PROTOCOL_STACK_IDLE:
        // 空闲状态,等待接收帧首字符(01)
        //		    if ((g_ComStat[port]==RECV_Wait)                        //当前正"接收等待"
        //		    &&(0x01== RXDByte))
        if (0x5A == RXDByte)//帧头
        {
            g_ComStat[port] = RECV_Going; //置"接收进行"状态
            g_ComBuff[port][0] = RXDByte;
//            u16FrameCheckSum = RXDByte;
						u16FrameCheckSum = 0;
            Protocol[port].DataCount = 1;
            Protocol[port].StatckStatus++;
            g_sys.status.ComSta.TEST |= 0x02;
            g_sys.status.ComSta.TEST4 = u16FrameCheckSum;
        }
        break;
    case PROTOCOL_STACK_CK:
        if (0xA5 == RXDByte) //当前正"接收等待"
        {
            // 累加校验和
//            u16FrameCheckSum += RXDByte;
            g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
            u8FrameDataLength = u8Length;
            Protocol[port].StatckStatus++;
            g_sys.status.ComSta.TEST |= 0x04;
        }
        else
        {
            // 帧错误,协议解析复位
            Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
            g_ComStat[port] = INIT_Apply; //置"发送等待"状态
        }
        g_sys.status.ComSta.TEST5 = u16FrameCheckSum;
        break;
    case PROTOCOL_STACK_RCV:
        // 累加校验和
        u16FrameCheckSum += RXDByte;
        g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
        u8FrameDataLength--;
        // 接收数据域的数据
        if (!u8FrameDataLength)
        {
            // 接收校验和
            g_sys.status.ComSta.TEST6 = u16FrameCheckSum;
            u8FrameDataLength = 1;
            Protocol[port].StatckStatus++;
        }
        g_sys.status.ComSta.TEST |= 0x08;
        break;
    case PROTOCOL_STACK_CS:
        g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
        u8FrameDataLength--;
        // 接收数据域的数据
        if (!u8FrameDataLength)
        {
            g_sys.status.ComSta.TEST |= 0x10;
            // 接收校验和
            u16CheckSum = g_ComBuff[port][u8Length+2];
//            u16CheckSum = (u16CheckSum << 8) | g_ComBuff[port][17];
            g_sys.status.ComSta.TEST2 = u16FrameCheckSum;
            g_sys.status.ComSta.TEST3 = u16CheckSum;
            if (u16CheckSum == (u16FrameCheckSum&0xFF))
            {
                g_sys.status.ComSta.TEST |= 0x20;
                Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
                g_ComStat[port] = RECV_Over; //置"接收完成"状态
            }
            else
            {
                // 校验和不正确,协议解析复位
                g_sys.status.ComSta.TEST |= 0x40;
                Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
                g_ComStat[port] = INIT_Apply; //置"初始化"状态
            }
        }
        break;
    case PROTOCOL_STACK_END:

        break;
    default:
        Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
        g_ComStat[port] = INIT_Apply; //置"初始化"状态
        break;
    }
    return 1;
}
#include "zph01_opt.h"

void USART1_IRQHandler(void)
{
    extern sys_reg_st g_sys;
    rt_interrupt_enter();
    //溢出错误
    if (USART_GetFlagStatus(USART1, USART_FLAG_ORE) == SET)
    {
        ;
    }
    //接收中断
    if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET)
    {
        if (g_sys.config.ComPara.u16Heater_PM25==PM25_ZP01)
        {
            zph01ReceiveData(USART_ReceiveData(USART1));
        }
        else
				if(g_sys.config.ComPara.u16Heater_PM25==Heater_JX)
        {
            JX_HeatPortSerialReceiveFSM(UART_HEAT);
        }
        else
        {
            HeatPortSerialReceiveFSM(UART_HEAT);
        }

        USART_ClearITPendingBit(USART1, USART_IT_RXNE);
    }
    //发送中断
    if (USART_GetITStatus(USART1, USART_IT_TXE) == SET)
    {
        ;
    }
    rt_interrupt_leave();
}
